/**********************************************************************
 Copyright (c), 1991-2007, T&W ELECTRONICS(SHENTHEN) Co., Ltd.
 文件名称 : web_utils.h
 文件描述 :


 函数列表 :


 修订记录 :
          1 创建 : 刘泽群
            日期 : 2007-8-27
            描述 :

**********************************************************************/


#ifndef __WEB_UTILS_H__
#define __WEB_UTILS_H__

#include "web_pub.h"


/******************************************************************************
 *                                 MACRO                                      *
 ******************************************************************************/
//#define WEB_TRACE       printf
#define WEB_ERROR       printf
#define WEB_REPORT      printf
#define WEB_FATAL       printf

#define WEB_PRINT       printf

/******************************************************************************
 *                                 ENUM                                       *
 ******************************************************************************/


/******************************************************************************
 *                                STRUCT                                      *
 ******************************************************************************/



/******************************************************************************
 *                               FUNCTION                                     *
 ******************************************************************************/


/*  函数功能: 将一个2位的十六进制数转换成字符整形                          */
unsigned char Hex2Uchar(const char * szHex);

/*  函数功能: 将内容写到buffer中, buffer为空则写到标准输出设备             */
int WEB_OutToBuffer(ST_OM_BLOCK *pstOutBuff, const char *szText, int nSize);

/*  函数功能: 将BUFFER内容写到指定的输出设备                               */
void WEB_WriteBuff(int nFD, const void *pBuffer, int nCount);

/*  函数功能: 取消命令中字符的转义                                         */
void WEB_CmdUnEsc(char *szCmd, int *pnSize);

void WEB_LogTrace(char *szFmt, ...);

void WEB_Trace();
void WEB_Error();
void WEB_Report();
void WEB_Fatal();


/******************************************************************************
 *                                 END                                        *
 ******************************************************************************/


#endif /* __WEB_UTILS_H__ */



