/**********************************************************************
 Copyright (c), 1991-2007, T&W ELECTRONICS(SHENTHEN) Co., Ltd.
 文件名称 : web_proc.h
 文件描述 : WEB服务器进程入口文件的信息定义

 函数列表 :


 修订记录 :
          1 创建 : 刘泽群 / 2007-8-21
            日期 :
            描述 :

**********************************************************************/

#ifndef __WEB_PROC_H__
#define __WEB_PROC_H__

#include "web_pub.h"
#include "web_cgi.h"


/******************************************************************************
 *                                 MACRO                                      *
 ******************************************************************************/


#define WEB_PROC_NAME       "webproc"

/******************************************************************************
 *                                 ENUM                                       *
 ******************************************************************************/

#define EN_PAGE_SUCCESS  0   /* 正确填充 */
#define EN_PAGE_ERROR    -1  /* 页面出错 */
#define EN_PAGE_EOF      -2  /* 页面结束 */

/******************************************************************************
 *                                STRUCT                                      *
 ******************************************************************************/

/* 页面结构 */
typedef struct tag_ST_WEB_PAGE_INFO
{
    char    pBuffer[WEB_LEN_TEXT_BUF];  /* 每次解析的缓冲*/
    char   *pRemain;                    /* 上次解析后的残余*/
    int     nFD;                        /* 文件描述符，缓冲内容来源*/
} ST_WEB_PAGE_INFO;



/******************************************************************************
 *                               FUNCTION                                     *
 ******************************************************************************/

/*  函数名称: WEB_File2Buff                                                */
int WEB_File2Buff(ST_WEB_PAGE_INFO *pstPage);

/*  函数功能: 根据提供的文件名进入页面显示入口                             */
void WEB_DisplayPage(char *szFileName);

void WEB_DisplayErr(PCSTR strErrInfo);



/******************************************************************************
 *                                 END                                        *
 ******************************************************************************/

#endif /* _WEB_PROC_H_ */

