{
"HELP_TOPIC1":"Internet fácil",
"HELP_CONTENT1_1_TITLE":"¿Qué es Internet?",
"HELP_CONTENT1_1":"Algunos definen Internet como 'La Red de Redes', y otros como 'La Autopista de la Información'. Efectivamente, Internet es una Red de Redes porque está hecha a base de unir muchas redes locales de ordenadores, o sea de unos pocos ordenadores en un mismo hogar, edificio o empresa. Esta red global tiene la característica de que utiliza un lenguaje común que garantiza la intercomunicación de los diferentes participantes. Este lenguaje común o <a class='help_link' href='javascript:linkContent(1,4)'> protocolo</a> se conoce como TCP/<a class='help_link' href='javascript:linkContent(1,5)'>IP</a>.",	
"HELP_CONTENT1_2_TITLE":"¿Cómo funciona Internet?",
"HELP_CONTENT1_2":"Cada ordenador que participa en <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> recibe el nombre de 'host'. Algunos 'host' sirven el contenido, información o aplicaciones por lo que se les denomina servidores. Y otros ordenadores como el que estás utilizando consumen el contenido o la información ofrecida por los servidores. A esta relación de le denomina cliente-servidor y es la base del funcionamiento de <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>: algunos ordenadores ofrecen información que es consumida y utilizada por otros.",
"HELP_CONTENT1_3_TITLE":"¿Qué es la web, www o World Wide Web?",
"HELP_CONTENT1_3":"Es importante saber que web o www no son sinónimo de <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>, la web es un subconjunto de <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> que consiste en páginas a las que se puede acceder usando un <a class='help_link' href='javascript:linkContent(1,9)'>navegador</a>. <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> es la red de redes donde reside toda la información. Tanto el correo electrónico, programas de mensajería, juegos, etc. son parte de <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>, pero no de la Web.",
"HELP_CONTENT1_4_TITLE":"¿Qué es un protocolo?",
"HELP_CONTENT1_4":"Un protocolo es el lenguaje establecido que utilizan los ordenadores al comunicarse e intercambiar información. Nosotros, como seres humanos, utilizamos el lenguaje como protocolo, en este caso hemos acordado comunicarnos con la lengua española.",
"HELP_CONTENT1_5_TITLE":"¿Qué significan las siglas IP? ¿Qué es una dirección IP?",
"HELP_CONTENT1_5":"La dirección IP  actúa como la matrícula o el DNI de cada ordenador en <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> o en la <a class='help_link' href='javascript:linkContent(1,8)'>red interna de tu casa</a>. Debe ser única en cada red y está compuesta por cuatro números separados por un punto. Por ejemplo, 192.168.1.1 es la dirección IP de HomeStation dentro de la <a class='help_link' href='javascript:linkContent(1,8)'>red de tu hogar</a>.",
"HELP_CONTENT1_6_TITLE":"¿Cómo puedo conectarme a Internet?",
"HELP_CONTENT1_6":"A lo largo de los años, la tecnología para acceder a <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> ha cambiado adaptándose a las necesidades de las personas y de los recursos. El principal motivo de cambio de los distintos tipos de accesos a <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> ha sido la velocidad de conexión. Actualmente se necesita una muy buena velocidad si se quieren aprovechar todos los recursos de <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> al máximo (animaciones, televisión online, 3D, videoconferencia, etc). Es lo que se conoce como <a class='help_link' href='javascript:linkContent(2,1)'>conexión de banda ancha</a>, siendo <a class='help_link' href='javascript:linkContent(2,3)'>ADSL</a> la tecnología de conexión más común para hogares y pequeñas empresas y la tecnología <a class='help_link' href='javascript:linkContent(2,4)'>3G</a> la favorita para dispositivos móviles (como teléfonos móviles u ordenadores portátiles).",
"HELP_CONTENT1_7_TITLE":"¿Por qué necesito HomeStation para navegar por Internet?",
"HELP_CONTENT1_7":"La clave de <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> es la capacidad de conectar y enviar información entre redes distintas. Así, la información puede llegar a ordenadores que no se encuentran en <a class='help_link' href='javascript:linkContent(1,8)'>tu red local</a>. Lo que se necesita es que en nuestra red haya un equipo (HomeStation o un router convencional) encargado de hacer de intermediario y conectar a otras redes que están en <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>.",
"HELP_CONTENT1_8_TITLE":"Dentro de mi casa, ¿hay una red?",
"HELP_CONTENT1_8":"Dentro de tu casa también hay una red de ordenadores como <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> pero interna y mucho más pequeña. Esto permite que puedas navegar por tu red local (conocida como 'Red del Hogar') y comunicarte entre los dispositivos (como ordenadores o impresoras) que tienes conectados a través de tu HomeStation para, por ejemplo, compartir archivos ente ellos.",
"HELP_CONTENT1_9_TITLE":"¿Qué es un navegador y para qué sirve?",
"HELP_CONTENT1_9":"Un navegador o explorador web (conocido en inglés como 'web browser') es un programa osoftware, por lo general gratuito, que nos permite visualizar páginas web a través de Internet. Los navegadores más utilizados son: <a class='help_link' href='http://www.microsoft.com/windows/internet-explorer/default.aspx' target='_blank'>Internet Explorer</a>, <a class='help_link' href='http://www.mozilla.com/firefox' target='_blank'>Mozilla Firefox</a>, <a class='help_link' href='http://www.apple.com/safari/' target='_blank'>Safari</a> y <a class='help_link' href='http://www.google.com/chrome' target='_blank'> Google Chrome</a>.",
"HELP_CONTENT1_10_TITLE":"¿Qué es una página web? ¿Es lo mismo que un sitio web?",
"HELP_CONTENT1_10":"Si lo comparáramos con un libro, un sitio web sería un libro entero y una página web de ese sitio web sería un capítulo de ese libro. Un sitio web es un sitio (localización) en <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> que contiene documentos (páginas web) organizados. Cada documento (página web) contiene gráficos, texto, audio, vídeo, y otros materiales dinámicos o estáticos que aparecen como información digital en la pantalla de un ordenador.",
"HELP_CONTENT1_11_TITLE":"¿Qué es el HTML?",	
"HELP_CONTENT1_11":"HTML es el acrónimo de HyperText Markup Language (Lenguaje de Marcado de Hipertexto) y es el lenguaje que se utiliza para crear <a class='help_link' href='javascript:linkContent(1,10)'>páginas web</a>. Este lenguaje indica a los <a class='help_link' href='javascript:linkContent(1,9)'>navegadores</a> cómo deben mostrar el contenido de una <a class='help_link' href='javascript:linkContent(1,10)'>página web</a>.",
"HELP_CONTENT1_12_TITLE":"¿Por qué algunas páginas web tardan más en cargarse que otras?",
"HELP_CONTENT1_12":"Aunque al popularizarse la <a class='help_link' href='javascript:linkContent(2,1)'>banda ancha</a> esto ha dejado en gran parte de ser un problema, al estar compuestas las <a class='help_link' href='javascript:linkContent(1,10)'>páginas web</a> por gráficos, texto, audio, vídeo,… la cantidad y complejidad de éstos influye en el tiempo que tardes en descargar una <a class='help_link' href='javascript:linkContent(1,10)'>página web</a>.No es lo mismo acceder a una página con sólo texto que hacerlo a una que incluye muchas imágenes y videos que son más pesados y por lo tanto pueden tardar más en ser descargados por tu <a class='help_link' href='javascript:linkContent(1,9)'>navegador</a>.",
"HELP_CONTENT1_13_TITLE":"¿Qué significa 'descargar de Internet'?",
"HELP_CONTENT1_13": "Descargar ('download' en inglés) es copiar datos (generalmente un archivo entero) desde alguna fuente en <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> a un dispositivo de tu casa, como por ejemplo tu ordenador. Lo contrario de descargar es subir ('upload' en inglés), que significa copiar un archivo de tu ordenador a otro ordenador que esté en <a class='help_link' href='javascript:linkContent(1,10)'>Internet</a>.",
"HELP_CONTENT1_14_TITLE":"¿Qué es un enlace o link?",
"HELP_CONTENT1_14":"Un enlace o link es un texto o imágenes en un <a class='help_link' href='javascript:linkContent(1,10)'>sitio web</a> que un usuario puede 'pinchar' para tener acceso o conectar con otro documento. Los enlaces son como la tecnología que conecta dos <a class='help_link' href='javascript:linkContent(1,10)'>sitios web</a> o dos <a class='help_link' href='javascript:linkContent(1,10)'>páginas web</a>. Cuando navegas por <a class='help_link' href='javascript:linkContent(1,10)'>Internet</a>, estos enlaces se ven usualmente como palabras subrayadas.",

"HELP_TOPIC2":"La banda ancha",
"HELP_CONTENT2_1_TITLE":"¿Qué es una conexión de banda ancha?",
"HELP_CONTENT2_1":"El ancho de banda es la cantidad de información o de datos que se puede enviar y recibir a través de tu conexión a <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>. El ancho de banda se mide generalmente en <a class='help_link' href='javascript:linkContent(2,2)'>bits por segundo (bit/s o bps)</a>, <a class='help_link' href='javascript:linkContent(2,2)'>kilobits por segundo (Kbit/s o Kbps)</a>, o <a class='help_link' href=javascript:linkContent(2,2)'>megabits por segundo (Mb/s o Mbps)</a>. En general, una conexión con ancho de banda alto se conoce como 'conexión de banda ancha' y es aquella que puede llevar la suficiente información como para reproducir de forma fluida (sin cortes ni interrupciones) un video.",
"HELP_CONTENT2_2_TITLE":"¿Qué es un bit? ¿Qué es un mega? ¿Y un giga?",
"HELP_CONTENT2_2":"Un bit es la unidad mínima de información empleada en informática. Con él, podemos representar dos valores cuales quiera, como verdadero o falso, abierto o cerrado, blanco o negro,… Basta con asignar uno de esos valores al estado de 'apagado' (0), y el otro al estado de 'encendido' (1). Para representar o codificar más información necesitamos agruparlos en una mayor cantidad de bits. Así 1 kilobit son mil bits, 1 megabit son un millón de bits y 1 gigabit corresponde con mil megabits (o mil millones de bits). Las conexiones más habituales de <a class='help_link' href='javascript:linkContent(2,1)'>banda ancha</a> suelen tener una velocidad de entre 1 y 6 Mbps,  Por ejemplo, con una velocidad de 1 Mbps puedes tardar aproximadamente un minuto en <a class='help_link' href='javascript:linkContent(1,13)'>descargar</a> una canción de <a class='help_link' href='javascript:linkContent(1,1)'>Internet.</a>",
"HELP_CONTENT2_3_TITLE":"¿Qué es ADSL?",
"HELP_CONTENT2_3":"ADSL significa Línea Digital Asimétrica de Abonado ('Asimetric Digital Subscriber Line' en inglés) y es la tecnología más empleada para conectarse a <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> por <a class='help_link' href='javascript:linkContent(2,1)'>banda ancha</a>.<br>En algunos países necesitas indicar tu usuario y tu password ADSL para que la conexión ADSL de tu HomeStation funcione. Si es tu caso, haz clic sobre el icono ADSL del Mapa de Red, en el menú 'Configurar conexión ADSL' introduce tu usuario y contraseña y haz clic en Aceptar.",
"HELP_CONTENT2_4_TITLE":"¿Qué es 3G?",
"HELP_CONTENT2_4":"3G es la abreviatura para tercera-generación de telefonía móvil. Es una tecnología que inicialmente se utilizó en los teléfonos móviles para enviar y recibir llamadas, pero que al ser una conexión de <a class='help_link' href='javascript:linkContent(2,1)'>banda ancha</a> también se utiliza en al actualidad para conectar a <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> a través de un teléfono móvil o un ordenador portátil.",

"HELP_TOPIC3":"Seguridad en Internet",	
"HELP_CONTENT3_1_TITLE":"¿Qué es una contraseña o 'password'?",
"HELP_CONTENT3_1":"Una contraseña o 'password' es una serie secreta de caracteres (normalmente letras y números) que permite a un usuario tener acceso a un ordenador o a un programa. Las contraseñas ayudan a asegurar que los usuarios desautorizados no tengan acceso a aquello que se está protegiendo. Idealmente, la contraseña debe ser algo que nadie pueda adivinar.",
"HELP_CONTENT3_2_TITLE":"¿Tiene HomeStation contraseña? ¿Para qué sirve?",
"HELP_CONTENT3_2":"Si, HomeStation tiene una contraseña de configuración. Te permite realizar cambios en la configuración de HomeStation y a la vez te asegura que sólo tú puedes hacer esos cambios. Puedes entrar a la página web de tu Homestation sin contraseña y ver el estado de tu red, pero cuando intentes acceder a funciones protegidas te preguntaremos la contraseña. Una vez que introduzcas la contraseña de HomeStation, podrás seguir configurando tu red y no te volveremos a molestar.",
"HELP_CONTENT3_3_TITLE":"¿Cómo cambio la contraseña de configuración?",
"HELP_CONTENT3_3":"La contraseña inicial la encontrarás en una pegatina debajo HomeStation. Puedes cambiarla por una diferente y te recomendamos que lo hagas. Para ello haz click en el enlace 'Cambiar contraseña' en la parte superior derecha del Mapa de Red.<br>Como se trata de una operación delicada, si aún no has introducido la contraseña se te pedirá.<br>Finalmente, aparecerá el formulario de cambio de contraseña. En el primer campo tendrás que introducir la contraseña actual y a continuación la contraseña nueva dos veces, para asegurarte de que no escribes algún carácter mal.<br>El indicador de fortaleza te dirá si tu nueva contraseña es buena o si es fácil de adivinar.",
"HELP_CONTENT3_4_TITLE":"He olvidado la contraseña de configuración, ¿qué puedo hacer?",
"HELP_CONTENT3_4":"Puedes restaurar la contraseña inicial presionando el botón posterior de HomeStation (reset) durante 10 segundos.<br>Tu contraseña volverá a ser la misma que hay en la pegatina inferior.<br>Ten en cuenta que HomeStation se reiniciará con sus parámetros de fábrica. Tu conexión a Internet seguirá funcionando, pero perderás toda tu configuración personal.",
"HELP_CONTENT3_5_TITLE":"¿Corro algún peligro al conectarme a Internet?",
"HELP_CONTENT3_5":"Por el simple hecho de conectarse a Internet no existe absolutamente ningún peligro. Otra cosa bien diferente son las potenciales amenazas que pueden producirse por un uso insensato y poco prudente de algunos servicios de <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> (como por ejemplo, ejecutar archivos poco fiables). Ten en cuenta que hay <a class='help_link' href='javascript:linkContent(1,10)'>sitios web</a> que son totalmente fiables. En general, todos los que sean de una marca conocida, los sitios personales, los portales, los buscadores, los centros de compras... La regla de oro para una navegación segura podría resumirse en: Si alguien te pide que instales algo, y no sabes que es lo que está pasando o en un momento determinado el <a class='help_link' href='javascript:linkContent(3,11)'>antivirus</a> te informa de una posible amenaza... NO LO HAGAS, NO INSTALES NADA QUE NO ENTIENDAS y sal de la página inmediatamente, cerrando el navegador si es preciso.",
"HELP_CONTENT3_6_TITLE":"¿Cómo puedo evitar el fraude y proteger mi información personal en Internet?",
"HELP_CONTENT3_6":"Cada vez es más importante proteger nuestra información personal y confidencial como <a class='help_link' href='javascript:linkContent(3,1)'>contraseñas</a>, números de tarjetas de crédito e información de cuentas bancarias. La siguiente lista muestra algunas cosas que puedes hacer para proteger tus datos confidenciales en <a class='help_link' href='javascript:linkContent(3,1)'>Internet</a>:<ul><li>-Antes de facilitar tu información, investiga que la empresa es real. Un <a class='help_link' href='javascript:linkContent(1,10)'>sitio web</a> no es una prueba de que la empresa exista.<li>- Asegúrate de que el <a class='help_link' href='javascript:linkContent(1,10)'>sitio web</a> es seguro, la dirección empezará con 'https', en vez de sólo 'http'.<li>- Cuando utilices tu tarjeta de crédito en un <a class='help_link' href='javascript:linkContent(1,10)'>sitio web</a> nuevo, comprueba tu cuenta bancaria en los siguientes días para asegurarte de que no se han realizando compras no autorizadas.<li>- No utilices la misma <a class='help_link' href='javascript:linkContent(3,1)'>contraseña</a> para todas tus cuentas. Si una cuenta se ve comprometida, todas tus cuentas se ven comprometidas.<li>- Mantén tu <a class='help_link' href='javascript:linkContent(3,11)'>antivirus</a> actualizado.<li>- No abras archivos adjuntos en correos electrónicos procedentes de alguien que no conoces.<li>- Nunca contestes a ningún correo electrónico que te pida tu información bancaria.<li>- Imprime los recibos de tus transacciones.</ul>",
"HELP_CONTENT3_7_TITLE":"¿Mi ordenador se puede contagiar de un virús a través de Internet?",
"HELP_CONTENT3_7":"Si, pero no te alarmes. Lo más corriente es vía >correo electrónico o al <a class='help_link' href='javascript:linkContent(1,13)'>descargarte</a> un archivo de una <a class='help_link' href='javascript:linkContent(1,10)'>página web</a> de dudosa procedencia. Y de manera general cuando se realizan intercambios de archivos. Pero es posible evitarlo si sigues una sencillas reglas y utilizas el sentido común:<ul><li>- Cada vez que nos encontremos ante un correo electrónico que contiene un archivo debemos procurar no abrirlo, sin antes pasarle un buen <a class='help_link' href='javascript:linkContent(3,11)'>antivirus</a>, y si es de dudosa procedencia eliminarlo sin más.<li>- En el caso de los archivos que nos descargamos de una <a class='help_link' href='javascript:linkContent(1,10)'>página web</a> debemos seguir la siguiente regla: Si alguien te pide que instales algo, y no sabes que es lo que está pasando o en un momento determinado el <a class='help_link' href='javascript:linkContent(3,11)'>antivirus</a> salta informándole de una posible amenaza... NO LO HAGAS, NO INSTALES NADA QUE NO ENTIENDAS.</ul>",
"HELP_CONTENT3_8_TITLE":"¿Qué es un virus informático?",
"HELP_CONTENT3_8":"Un virus informático es un software que se auto-ejecuta y se propaga insertando copias de sí mismo en otro programa o documento. Como los virus humanos, los virus de ordenador pueden propagarse en gran medida: algunos virus solo causan efectos ligeramente molestos mientras que otros pueden dañar tu hardware, software o archivos. Casi todos los virus se unen a un fichero ejecutable, lo que significa que el virus puede estar en tu ordenador pero no puede infectarlo a menos que ejecutes o abras el programa infectado. Es importante observar que un virus no puede continuar su propagación sin la acción humana, (por ejemplo ejecutando un programa infectado). La gente contribuye a la propagación de los virus, muchas veces sin saberlo, al compartir archivos infectados o al enviar correos electrónicos con virus como archivo adjunto.",
"HELP_CONTENT3_9_TITLE":"¿Qué NO es un virus informático?",
"HELP_CONTENT3_9":"Muchas veces creemos que nuestros problemas informáticos se deben a <a class='help_link' href='javascript:linkContent(3,8)'>virus</a>. Los siguientes problemas normalmente no están causados por virus:<ul><li>- Problemas de hardware. No existen <a class='help_link' href='javascript:linkContent(3,8)'>virus</a> que puedan dañar el hardware físicamente.<li>- El ordenador produce un pitido al ponerlo en marcha y en la pantalla no aparece nada. La mayoría de las veces esto se debe a un problema de hardware durante el proceso de arranque.<li>- No puedes abrir un archivo. Si no tienes problemas abriendo otros archivos, puede ser que el archivo que no puedes abrir esté dañado.</ul>",
"HELP_CONTENT3_10_TITLE":"¿Qué programas necesito para navegar seguro por Internet?",
"HELP_CONTENT3_10":"De forma general es muy recomendable tener siempre instalado y actualizado un <a class='help_link' href='javascript:linkContent(3,11)'>antivirus</a> y un programa <a class='help_link' href='javascript:linkContent(3,12)'>anti software espía o antispyware</a>. Si quieres tener una protección adicional puedes instalar un <a class='help_link' href='javascript:linkContent(3,13)'>cortafuegos o 'firewall'</a> y, en caso de tener hijos pequeños en casa, puede serte útil un programa de control parental.",
"HELP_CONTENT3_11_TITLE":"¿Qué es un antivirus? ¿Para qué sirve?",
"HELP_CONTENT3_11":"Es un software cuya finalidad es prevenir y evitar la infección de <a class='help_link' href='javascript:linkContent(3,8)'>virus</a>, impidiendo también su propagación. Tiene capacidad para detectar y eliminar los <a class='help_link' href='javascript:linkContent(3,8)'>virus</a> y restaurar los archivos afectados por su infección.",
"HELP_CONTENT3_12_TITLE":"¿Qué es un programa anti software espía o antispyware? ¿Para qué sirve?",
"HELP_CONTENT3_12":"El spyware o software espía es cualquier aplicación informática que recolecta información del computador desde donde está operando. Por lo general se introduce y opera en los equipos sin que el usuario lo advierta. Por lo tanto un programa antispyware es un software para eliminar el spyware.",
"HELP_CONTENT3_13_TITLE":"¿Qué es un cortafuegos o firewall? ¿Para qué sirve?",
"HELP_CONTENT3_13":"Un cortafuegos o firewall es un software que previene el uso y el acceso desautorizados a tu computador, y los ataques desde <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>. Un cortafuegos examina lo que llega de <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> y dependiendo de su naturaleza le permite seguir o, al contrario, lo bloquea. Es decir, que lo inocuo entra y lo potencialmente dañino (un ataque) es rechazado. Si está instalado, todos los mensajes que entran o salen de la <a class='help_link' href='javascript:linkContent(1,8)'>red de tu casa</a> pasan a través del cortafuegos, que examina cada mensaje y bloquea los que no cumplen los criterios de seguridad especificados. Es importante recordar que un cortafuegos no elimina problemas de <a class='help_link' href='javascript:linkContent(3,8)'>virus</a> del computador, sino que cuando se utiliza conjuntamente con las actualizaciones que regularmente le propone su sistema Windows (u otro sistema operativo) y un buen <a class='help_link' href='javascript:linkContent(3,11)'>antivirus</a>, añadirá seguridad y protección adicionales a tu computador y red.",
"HELP_CONTENT4_1_TITLE":"¿Qué es el mapa de red?",
"HELP_CONTENT4_1":"El mapa de red es una representación gráfica de todos los ordenadores y dispositivos (como por ejemplo impresoras, teléfonos móviles, videoconsolas,…) en la <a class='help_link' href='javascript:linkContent(1,8)'>red de tu hogar</a>. Muestra qué dispositivos están conectados y cuáles ya no lo están (con un color gris más claro). Además te indica si están conectados por <a class='help_link' href='javascript:linkContent(4,5)'>cable</a> o a la <a class='help_link' href='javascript:linkContent(4,6)'>red inalámbrica (WiFi)</a>.",
"HELP_CONTENT4_2_TITLE":"¿Cómo puedo conectar mis dispositivos (ordenadores, teléfonos móviles,...) a Internet a través de HomeStation?",
"HELP_CONTENT4_2":"Lo más fácil es conectarlos a la red inalámbrica WiFi que crea HomeStation. Si el dispositivo va a estar en un sitio fijo cerca de tu HomeStation también puedes conectarlo con el cable RJ45.<br>Si decides utilizar la red inalámbrica, entra en el menú de configuración pinchando en el icóno de HomeStation dentro del Mapa de Red. Fíjate en estos parámetros de configuración de la WiFi porque los necesitarás luego para conectar tus dispositivos.<br>Debes conectar cada unos de tus dispositivos siguiendo las instrucciones de su sistema operativo. En general, deberás entrar en la configuración de redes inalámbricas del dispositivo, buscar la WiFi de HomStation y conéctate a ella. Si se te pide un protocolo de seguridad, selecciona uno de acuerdo con el nivel de seguridad que configuraste en HomeStation. Las siglas entre paréntesis te darán una pista.<br>Cuando se te pida la clave de la WiFi pon la misma que tenga configurada la WiFi de tu HomeStation.<br>Así tendrás conectados los dispositivos a la red de tu hogar. Para que tengan acceso a internet te recomendamos que actives el DHCP en tu HomeStation y configures tus dispositivos para que lo utilicen.",
"HELP_CONTENT4_3_TITLE":"¿Para qué sirve la entrada USB de HomeStation?",
"HELP_CONTENT4_3":"USB son las siglas de Universal Serial Bus. En ordenadores, un USB es un sistema que transfiere datos o electricidad entre componentes del propio ordenador o entre ordenadores. HomeStation puede comunicarse con impresoras (para compartir una única impresora a todos los ordenadores de la <a class='help_link' href='javascript:linkContent(1,8)'>red de tu hogar</a>) y con discos duros o llaves USB (para acceder a sus archivos desde cualquier ordenador de la <a class='help_link' href='javascript:linkContent(1,8)'>red de tu hogar</a>) y para llevar a cabo esta comunicación utiliza esta entrada USB.",
"HELP_CONTENT4_4_TITLE":"HomeStation sólo tiene una entrada USB, ¿cómo conecto un disco y una impresora al mismo tiempo?",
"HELP_CONTENT4_4":"Si necesitas conectarlos a la vez, te recomendamos que compres un Hub Expansor de puertos USB. Son muy baratos y podrás tener fácilmente 4 dispositivos conectados al USB de HomeStation.",
"HELP_CONTENT4_5_TITLE":"¿Qué diferencia hay entre conectar un ordenador por cable o a través de la red inalámbrica (WiFi)?",
"HELP_CONTENT4_5":"La conexión por cable es más segura, ya que se requiere un acceso físico directo a tu HomeStation. Nunca vas a tener intrusos en tu red si deshabilitas la WiFi y sólo utilizas conexiones por cable.<br>Sin embargo, será mucho más cómodo para ti conectar tus equipos a la red inalámbrica y seguirá siendo seguro si la configuras adecuadamente.<br>La conexión por cable es más rápida, pero si vas a utilizar tu ordenador para conectarte a Internet normalmente no vas a notar diferencia entre conectar tus equipos por cable o por WiFi.",
"HELP_CONTENT4_6_TITLE":"¿Cómo funciona la red inalámbrica (WiFi)?",
"HELP_CONTENT4_6":"En este tipo de redes las comunicaciones entre dispositivos se realizan a través del 'aire'. No es necesario un cable para llevar los 'mensajes' de un dispositivo a otro, ya que estos mensajes se transforman en señales electromagnéticas que viajan por el aire igual que lo hace la luz visible. No te asustes, estas señales son seguras, de hecho, la luz que vemos también es radiación electromagnética, emitida en un determinado rango de frecuencias que nuestros ojos son capaces de captar.<br>En el caso de WiFi, las señales electromagnéticas se emiten en la banda de 2.4 Gigahertzios.<br>Tu HomeStation actúa como punto de acceso o coordinador de esta red inalámbrica y permite o deniega el acceso de los dispositivos a la red.<br>",
"HELP_CONTENT4_8_TITLE":"¿Cómo configuro mi red inalámbrica (WiFi)?",
"HELP_CONTENT4_8":"Encontrarás el menú de configuración de la WiFi pinchando sobre icono de HomeStation dentro del Mapa de Red. Este menú contiene un apartado dedicado a la Configuración de la WiFi en el que puedes configurar todo lo relacionado con la red inalámbrica de tu HomeStation.<br>Puedes activar y desactivar la red inalámbrica.<br>Puedes ver y cambiar el nombre de la red WiFi.<br>Puedes hacer que la red sea visible por los dispositivos y aparezca cuando busques redes u ocultarla, para evitar exponer tu red a intrusos.<br>Puedes configurar el nivel de seguridad y la clave de tu WiFi.<br>Y por último puedes configurar el modo de selección del canal que utiliza tu red.",
"HELP_CONTENT4_9_TITLE":"¿Cómo puedo cambiar el nombre de mi red inalámbrica (WiFi)? ¿Por qué es útil?",
"HELP_CONTENT4_9":"Simplemente entra en el menú de configuración de HomeStation haciendo clic sobre el icono de HomeStation en el Mapa de Red. En la sección de red inalámbrica, puedes ver y modificar el nombre de tu WiFi.<br>Dependiendo del lugar, es muy posible que haya muchas redes en el entorno. Poner un nombre que signifique algo para ti te ayudará a localizar tu red cuando la busques para conectar tus dispositivos.<br>Si decides cambiar el nombre cuando ya tienes tu red funcionando, ten en cuenta que tendrás que volver a configurar la conexión inalámbrica de tus dispositivos.<br>",
"HELP_CONTENT4_10_TITLE":"¿Qué significa nivel de seguridad de mi red inalámbrica (WiFi)?",
"HELP_CONTENT4_10":"En las redes inalámbricas tus datos y comunicaciones se transmiten por el 'aire', es necesario un mecanismo que evite a los intrusos que podrían escuchar tus comunicaciones, utilizar tu red, modificar tus datos, etc...<br>Para ello existen mecanismos y protocolos para encriptar y hacer seguras las comunicaciones inalámbricas. No utilizarlos es totalmente inseguro.<br>Si los utilizas, debes saber que hay algunos que han quedado anticuados y no suponen ninguna barrera para los intrusos (Protocolo WEP, nivel de seguridad bajo). Se siguen utilizando para poder conectar por WiFi dispositivos antiguos, pero no te recomendamos su uso.<br>Si quieres que tu red sea segura, utiliza un nivel de seguridad alto. Esto implica que tus comunicaciones inalámbricas estarán protegidas por los protocolos WPA y WPA2 que actualmente se consideran seguros.",
"HELP_CONTENT4_11_TITLE":"¿Qué es la fortaleza de la clave de mi red inalámbrica (WiFi)? ",
"HELP_CONTENT4_11":"La fortaleza de tu clave indica lo difícil que es de adivinar por un intruso que pretenda conectarse a tu red sin tu permiso.",
"HELP_CONTENT4_12_TITLE":"¿Qué es el canal de mi red inalámbrica (WiFi)? ¿Por qué ponerlo en modo manual? ",
"HELP_CONTENT4_12":"La red WiFi puede utilizar diferentes bandas de frecuencia, normalmente numerados del 1 al 13. Si tu red y la de tu vecino están utilizando el mismo canal de frecuencia es posible que se produzcan interferencias entre ambas redes y la calidad de ambas baje o incluso no se puedan utilizar.<br>En el modo manual, puedes forzar a tu HomeStation a utilizar canales concretos para cambiar tu canal e intentar evitar estos problemas.",
"HELP_CONTENT4_13_TITLE":"¿Qué significa DHCP? ¿Para qué sirve?",
"HELP_CONTENT4_13":"Es un protocolo por el que tu HomeStation asigna automáticamente direcciones IP y otros parámetros de red a tus dispositivos cuando estos se conectan a tu Red del Hogar. Es muy cómodo y evitará que tengas que establecer manualmente los parámetros de red de cada uno de tus equipos.",

"HELP_TOPIC5":"Equipos en mi red",
"HELP_CONTENT5_1_TITLE":"¿Qué tipo de equipos puedo conectar a Internet a través de HomeStation?",
"HELP_CONTENT5_1":"Puedes conectar cualquier dispositivo IP que tenga conectores de red RJ45 (el típico conector de cable de re, un poco más grande que el conector del cable telefónico), o que soporte WiFi (en ese caso comprueba en el manual del dispositivo que soporte uno de los siguientes protocolos: 802.11b ó 802.11g).",
"HELP_CONTENT5_2_TITLE":"Mis equipos antiguos no se conectan. ¿Qué puede estar pasando?",
"HELP_CONTENT5_2":"Si están conectados por WiFi, al ser antiguos es posible que no estén preparados para comunicarse utilizando el protocolo de seguridad que tengas seleccionado. Comprueba el nivel de seguridad y el manual del fabricante del dispositivo. Si no soporta WPA, tendrás que seleccionar un nivel de seguridad bajo (protocolo WEP) o 'Sin seguridad' en tu HomeStation, para poder conectar tu dispositivo. Sin embargo, el nivel de seguridad de todos los dispositivos de tu red bajará por lo que no te lo recomendamos.",	
"HELP_CONTENT5_3_TITLE":"Ha aparecido un equipo que no identifico porque el nombre es una serie de números (192.168...). ¿Cómo puedo identificarlo?",
"HELP_CONTENT5_3":"¿Has tenido últimamente alguna visita en casa? Es posible que se trate de algún ordenador portátil o teléfono móvil que haya estado en tu casa.<br>Si no es así, primero debes fijarte en el símbolo que acompaña al icono del dispositivo, en la parte superior derecha. Te indica si el dispositivo está conectado por red cableada, por WiFi o por USB. Eso debería ayudarte a identificar qué dispositivo es.<br>Comprueba si está conectado o desconectado, eso también podría darte una pista. Puedes probar a conectar y desconectar dispositivos hasta que el estado del equipo sin identificar cambie en el Mapa de Red.<br>Una vez localizado el equipo, te recomendamos que lo personalices, dándole un nombre y asignándole un tipo de dispositivo, para que en el futuro tengas claro de qué equipo se trata.<br>Si es un equipo que no va a volver a estar conectado, es mejor que entres en su configuración y hagas clic en 'Olvidar dispositivo'. Así no te volverá a molestar.",
"HELP_CONTENT5_4_TITLE":"¿Cómo dejo de ver en mi mapa de red un equipo que ya no uso?",
"HELP_CONTENT5_4":"Sobre el Mapa de Red, haz clic en el dispositivo para abrir su configuración. Haz clic en 'Olvidar dispositivo' y ya no aparecerá más en tu mapa de red. A no ser, claro, que vuelvas a conectarlo.<br>Si no encuentras el enlace 'Olvidar dispositivo', puede ser que el dispositivo se encuentre conectado todavía. En ese caso desconéctalo, y vuelve a intentarlo.",
"HELP_CONTENT5_5_TITLE":"¿Cómo configuro un equipo?",
"HELP_CONTENT5_5":"En el Mapa de Red puedes ver el icono de HomeStation y a su derecha una bolsa en la que aparecen los dispositivos de tu red. Son equipos que están o han estado conectados a tu red del hogar, ya sea por cable, por WiFi o por USB. Algunos puede que ya no estén conectados y aparecerán más difuminados.<br>Conectados o no, puedes configurarlos haciendo clic en su icono. Lo cual abrirá una ventana de diálogo en la que podrás realizar las siguientes opciones:<br>-Dar un nombre al equipo<br>-Asignarle un tipo de dispositivo, para que aparezca representado con una imagen más adecuada.<br>-Ver su dirección IP y su estado.<br>-Olvidar el dispositivo.<br>-Abrir puertos para este dispositivo<br>Si necesitas una configuración más avanzada de aplicaciones y puertos, puedes hacer clic en 'Configurar aplicaciones y puertos'.",
"HELP_CONTENT5_6_TITLE":"¿Qué es un equipo desconocido?",
"HELP_CONTENT5_6":"Se trata de un equipo que aún no ha sido configurado, es decir, un dispositivo al cual aún no le has asignado nombre ni tipo de dispositivo. Por lo que aparecerá con un icono genérico que no da ninguna información sobre qué tipo de dispositivo es y puede aparecer con una dirección IP en lugar de nombre.<br>Normalmente se tratará de un dispositivo nuevo en tu red que acabas de conectar recientemente. Aunque si no tienes activado un nivel de seguridad alto en tu WiFi, también puede que se trate del equipo de un vecino que se ha colado en tu red. En ese caso, olvidarlo el dispositivo no impedirá que se vuelva a conectar, y será necesario que subas el nivel de seguridad de tu WiFi.",
"HELP_CONTENT5_7_TITLE":"¿Sabías que puedes compartir tus archivos y tu impresora con los equipos conectados en la red de tu hogar?",
"HELP_CONTENT5_7":"Así es. Si conectas a tu HomeStation un dispositivo de almacenamiento USB con tus archivos, podrás acceder a ellos desde cualquiera de tus equipos del hogar. Pínchalo en tu HomeStation, aparecerá en tu mapa de red como un dispositivo más.<br>Si conectas a tu HomeStation una impresora USB podrás utilizarla para imprimir desde cualquiera de tus equipos del Hogar. Pínchalo en tu HomeStation y también aparecerá en tu mapa de red.",		
"HELP_CONTENT5_8_TITLE":"¿Cómo accedo desde mi equipo a los contenidos de mi pendrive o mis disco duro USB conectado a HomeStation?",
"HELP_CONTENT5_8":"Para acceder a tus archivos desde un equipo con Sistema Operativo Windows, entra a esta página desde el equipo, localiza el icono del dispositivo de almacenamiento en el Mapa de Red, pincha sobre él y descarga el archivo de instalación en el equipo. Ejecútalo desde allí y sigue sus instrucciones.",		
"HELP_CONTENT5_9_TITLE":"¿Cómo instala en mi equipo la impresora USB conectada a HomeStation?",
"HELP_CONTENT5_9":"Para acceder a la impresora desde un equipo con Sistema Operativo Windows, entra a esta página desde el equipo, localiza el icono de la impresora en el Mapa de Red, pincha sobre él y descarga el archivo de instalación en el equipo. Ejecútalo desde allí y sigue sus instrucciones. Si tienes algún problema en el proceso, es recomendable que instales los drivers de la impresora siguiendo las instrucciones del fabricate y lo vuelvas a intentar.",

"HELP_TOPIC6":"Aplicaciones y puertos",
"HELP_CONTENT6_1_TITLE":"¿Qué son los puertos?",
"HELP_CONTENT6_1":"Los puertos sirven para que las aplicaciones de un equipo se comuniquen entre sí o con otras aplicaciones de otros equipos.<br>En un ordenador hay muchas aplicaciones ejecutándose a la vez y comunicándose con otras aplicaciones de otros ordenadores a través de Internet. Estas comunicaciones se hacen mediante el envío de mensajes. Imagina que estoy chateando contigo, mi aplicación de mensajería enviará un mensaje a tu ordenador con el texto que te estoy escribiendo. Ese mensaje tendrá la dirección IP de tu ordenador como dirección de destino, y la red sabrá hacer llegar el mensaje a tu ordenador. Pero una vez que tu ordenador ha recibido el mensaje ¿Cómo sabe qué tiene que hacer con él? Ha llegado un mensaje de la red ¿Para qué aplicación es? ¿Para el gestor de correo? ¿Para el navegador web? ¿Para el juego On-Line que también está arrancado?<br>Para resolver esto se utilizan los puertos. Son como direcciones o apartados de correos dentro de un equipo. Una aplicación está escuchando en un puerto concreto (o varios), y así otras aplicaciones son capaces de enviar mensajes a ese ordenador a ese puerto concreto. El sistema operativo recibe el mensaje de la red y se lo pasa a la aplicación que esté escuchando en ese puerto.<br>Así que los puertos son un concepto lógico, un número, no existen como algo físico, y cada equipo dispone de un gran número de ellos, del 1 al 65535, para que las aplicaciones los utilicen en sus comunicaciones.<br>En principio están sin utilizar, y las aplicaciones los van reservando cuando los necesitan.",
"HELP_CONTENT6_2_TITLE":"¿En qué consiste abrir puertos?",
"HELP_CONTENT6_2":"Consiste en configurar tu HomeStation para que permita que sistemas externos a tu red, que se encuentran en internet, puedan iniciar una comunicación con un equipo de tu red del hogar. Esto en principio no está permitido por motivos de seguridad, y tienes que ser tu quien abra los puertos para permitir este tipo de comunicaciones a una aplicación en la que confíes.<br>Si has entendido bien qué son los puertos, vayamos un poco más allá... Tus equipos tienen puertos para comunicarse, tu HomeStation también tiene sus propios puertos para recibir mensajes desde internet. Cuando llegan mensajes que no han sido pedidos por un equipo de tu red, tu HomeStation no hace nada con ellos, los ignora. Así en principio tu red es segura y nada desde fuera puede conectarse con los equipos de tu red, si tú no inicias la comunicación. Sin embargo algunas aplicaciones que usan mucho la red funcionarían mejor si la comunicación se pudiese iniciar en ambos sentidos (programas de mensajería, P2P, juegos, etc...). Ese tipo de aplicaciones a menudo te pedirán que abras los puertos para funcionar.<br>¿En qué consiste abrir los puertos? Consiste que configures tu HomeStation para que los mensajes que reciba dirigidos a un determinado puerto, los deje pasar y se los redirija un puerto concreto de uno de los equipos de tu red. Por ejemplo, si tu videoconsola utiliza el puerto 3655, podrías redirigir el puerto 3655 de tu HomeStation al puerto 3655 de tu videoconsola.",
"HELP_CONTENT6_3_TITLE":"¿Para qué necesito abrir un puerto?",
"HELP_CONTENT6_3":"Algunas aplicaciones que utilizan mucho la red lo necesitan para funcionar o para ir más rápido. Suelen ser programas de mensajería, aplicaciones P2P, juegos, etc...<br>Los puertos que utilice la aplicación estarán redirigidos de tu HomeStaion a tu equipo y así, otros equipos de internet podrán conectarse con tu aplicación.",
"HELP_CONTENT6_4_TITLE":"¿Cómo abro un puerto para una aplicación y se la asigno a un dispositivo?",
"HELP_CONTENT6_4":"Tienes varias maneras:<br>La más sencilla es que entres en la configuración del dispositivo en el Mapa de Red y en la sección 'Puertos abiertos para este dispositivo' actives la aplicación para la que quieres abrir los puertos de ese dispositivo. Después haz clic en aceptar y HomeStation abrirá los puertos que corresponda para el equipo.<br>Si no aparece la aplicación que quieres o ya está asignada a otro dispositivo (el check aparecerá desactivado y con el icono del dispositivo a la derecha de la aplicación), tendrás que crear una nueva aplicación en 'Configurar aplicaciones y puertos'. Haz clic y utiliza la configuración avanzada de puertos para crear una aplicación nueva que abra los puertos que necesarios para tu dispositivo.",
"HELP_CONTENT6_5_TITLE":"¿Cómo funciona la sección Configurar aplicaciones y puertos?",
"HELP_CONTENT6_5":"El uso de esta sección es más fácil de lo que parece.<br>En el lado izquierdo tienes la lista de aplicaciones que ya están configuradas. Recuerda que aquí una aplicación consiste en un conjunto de reglas que abren puertos. No nos referimos a la aplicación en sí, sino al conjunto de reglas (puertos abiertos) necesarias para que esa aplicación funcione correctamente.<br>Volviendo a la lista, verás que a su derecha, unas tienen un icono de dispositivo y otras no. El icono indica que esa aplicación está asociada a un dispositivo. HomeStation ha abierto los puertos de esa aplicación para ese dispositivo. No podrás asociársela a otro dispositivo sin cancelar la asociación actual. El resto de aplicaciones (las que no tienen icono) son aplicaciones que no están asociadas a ningún dispositivo. Puedes utilizarlas y se abrirán los puertos correspondientes para el dispositivo que quieras.<br>Para modificar una aplicación de la lista haz clic sobre ella y la configuración de la aplicación se editará en el panel derecho, desde el cual podrás cambiar su nombre, sus reglas de apertura de puertos y asignarla a un dispositivo.<br>Si necesitas crear una aplicación nueva (porque aún no existe o no está disponible), haz clic sobre el botón '+', debajo de la lista de aplicaciones. En el panel derecho aparecerá la configuración (vacía) de tu nueva aplicación. Dale un nombre, añádele las reglas de apertura de puertos que necesitas y asígnala a un dispositivo.<br>Si quieres borrar una aplicación selecciónala en la lista de aplicaciones y haz clic sobre el botón '-' que hay debajo de la lista.<br>Para cambiar el nombre de una aplicación, en el panel de edición de aplicaciones, haz clic sobre el icono de lápiz situado al lado de su nombre actual y podrás darle un nombre diferente.<br>Para añadir una regla a una aplicación, cuando tengas seleccionada la aplicación haz clic sobre '+ Añadir regla', y una nueva regla vacía se añadirá a la lista de reglas. Modifícala.<br>Para modificar una regla, juega con los campos que la forman, son bastante intuitivos. Con el primer botón puedes establecer si abrir un solo puerto o un rango de varios puertos consecutivos. Dependiendo del caso, indica el número de puerto o los puertos primero y último del rango. Por último debes indicar si lo puertos deben abrirse sólo para tráfico TCP, sólo para tráfico UDP o para los dos.<br>Para borrar una regla, haz clic en el botón '-' situado al final de la regla correspondiente.<br>Para asociar la aplicación a un dispositivo, sitúate en la lista desplegable 'Para el dispositivo'  y selecciona el dispositivo para el que quieras abrir los puertos.<br>Cuando hayas terminado de modificar la aplicación, haz clic en 'Guardar cambios' antes de cerrar el cuadro de diálogo o de cambiar de aplicación. Los cambios que hayas hecho se guardarán y se abrirán los puertos que correspondan.",
"HELP_CONTENT6_6_TITLE":"¿Puedo tener varios ordenadores configurados con los puertos de una aplicación abiertos?",
"HELP_CONTENT6_6":"Sí y no.<br>En principio, el mecanismo de redirección (apertura) de puertos no te permite hacer esto. Un puerto sólo puede estar abierto o redirigido a un único dispositivo. Y por lo tanto cada aplicación sólo podrá estar asignada a un equipo.<br>Sin embargo, puedes una o más aplicaciones similares, que utilicen otros números de puertos. En ese caso, desde los ordenadores o equipos adicionales deberás configurar la aplicación para que utilice los puertos que le hayas asignado en HomeStation. Consulta cómo hacer esto en el manual de la aplicación concreta."
}
