{
"HELP_CONTENT1_1":"Alguns definem a Internet como 'rede de redes' e outros como 'A estrada da informação.' Na verdade, a Internet é uma rede de redes, pois é feita a partir da conexão de muitas redes locais de computadores, ou computadores em uma casa, prédio ou empresa. Esta rede global usa uma linguagem comum, que garante a intercomunicação entre os diferentes participantes. Essa linguagem comum ou <a class='help_link' href='javascript:linkContent(1,4)'>protocolo</a>, é conhecido como TCP/<a class='help_link' href='javascript:linkContent(1,5)'>IP</a>.",
"HELP_CONTENT1_0":"Clique sobre o ícone ADSL e uma nova janela se abrirá. No campo “Usuário” digite o nome de usuário fornecido pelo seu provedor de acesso (ex: nome@provedor.com.br) e sua senha.",
"HELP_CONTENT1_1_TITLE":"O que é a Internet?",
"HELP_CONTENT1_0_TITLE":"Como configurar seu usuário e senha do provedor de acesso?",
"HELP_CONTENT1_10":"Se você compará-la com um livro, um Web Site seria um livro inteiro e uma página web seria um capítulo desse livro. Um Web Site é um site (local) na <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> que contém documentos (páginas web) organizados. Cada documento (página web) contém elementos gráficos, texto, áudio, vídeo e outros materiais estáticos ou dinâmicos que aparecem como informação digital em uma tela de computador.",
"HELP_CONTENT1_10_TITLE":"O que é uma página web? É o mesmo que um web site?",
"HELP_CONTENT1_11":"HTML é a sigla para 'HyperText Markup Language' (Linguagem de Marcação de Hipertexto) e é a linguagem usada para criar <a class='help_link' href='javascript:linkContent(1,10)'>páginas web</a>. Esta linguagem diz ao <a class='help_link' href='javascript:linkContent(1,9)'>navegador</a> como exibir o conteúdo de uma <a class='help_link' href='javascript:linkContent(1,10)'>página web</a>.",
"HELP_CONTENT1_11_TITLE":"O que é HTML?",
"HELP_CONTENT1_12":"Embora com a <a class='help_link' href='javascript:linkContent(2,1)'>banda larga</a> esse problema tenha se tornado menor, <a class='help_link' href='javascript:linkContent(1,10)'>páginas web</a> são compostas por gráficos, texto, áudio, vídeo, ... a quantidade e a complexidade desses elementos influenciam no tempo que se leva para baixar uma <a class='help_link' href='javascript:linkContent(1,10)'>página web</a>. Acessar uma página com textos apenas não é a mesma coisa do que acessar uma página que inclui muitas imagens e vídeos, que são bem mais pesados (usam mais bits) e, portanto, pode levar muito mais tempo para ser baixada pelo seu <a class='help_link' href='javascript:linkContent(1,9)'>navegador</a>.",
"HELP_CONTENT1_12_TITLE":"Por que algumas páginas web demoram mais para carregar do que outras?",
"HELP_CONTENT1_13":"'Download' é a ação de copiar dados (geralmente um arquivo inteiro) a partir de qualquer fonte na <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> para um dispositivo em sua casa, tal como o seu computador. O oposto de 'download'  é 'upload', que significa copiar um arquivo de seu computador para outro computador que esteja na <a class='help_link' href='javascript:linkContent(1,10)'>Internet</a>.",
"HELP_CONTENT1_13_TITLE":"O que significa 'download da Internet'?",
"HELP_CONTENT1_14":"Um link é um texto ou imagem em um <a class='help_link' href='javascript:linkContent(1,10)'>site</a> em que um usuário pode clicar para ter acesso a outro documento, que pode estar na mesma página, no mesmo <a class='help_link' href='javascript:linkContent(1,10)'>site</a> ou ainda em outro <a class='help_link' href='javascript:linkContent(1,10)'>site</a>. É a tecnologia que conecta duas <a class='help_link' href='javascript:linkContent(1,10)'>páginas web</a>. Quando você navega na <a class='help_link' href='javascript:linkContent(1,10)'>Internet</a>, esses links são geralmente vistos como palavras sublinhadas ou de outra cor.",
"HELP_CONTENT1_14_TITLE":"O que é um link?",
"HELP_CONTENT1_2":"Cada computador na <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> é chamado de 'host'. Alguns 'hosts' fornecem conteúdo, informações ou aplicações e são chamados de servidores. Outros computadores, como o que está utilizando, consomem o conteúdo ou as informações oferecidos pelos servidores. Este relacionamento chamado cliente-servidor é a base da <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>: alguns computadores fornecem informações que são consumidas e utilizadas por outros.",
"HELP_CONTENT1_2_TITLE":"Como funciona a Internet?",
"HELP_CONTENT1_3":"É Importante saber que  web ou www não são sinônimos de <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>. A Web é um subconjunto da <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> que consiste de páginas que podem ser acessadas através de um  <a class='help_link' href='javascript:linkContent(1,9)'>navegador</a>. <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> é a rede das redes, onde reside toda a informação. E-mails, programas de mensagens, jogos, etc... fazem parte da <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>, mas não da Web.",
"HELP_CONTENT1_3_TITLE":"O  que é a web, www ou World Wide Web (Rede de alcance mundial)?",
"HELP_CONTENT1_4":"Um protocolo é a linguagem estabelecida que os computadores usam para se comunicar e trocar informações. Nós, como seres humanos, usamos a linguagem como protocolo. No caso, concordamos em usar o idioma português para nos comunicar.",
"HELP_CONTENT1_4_TITLE":"O que é um protocolo?",
"HELP_CONTENT1_5":"IP significa 'Internet Protocol' (Protocolo Internet). O endereço IP atua como o registro ou identidade de cada computador na <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> ou <a class='help_link' href='javascript:linkContent(1,8)'>rede interna em sua casa</a>. Deve ser único em cada rede e consiste de quatro números separados por um ponto. Por exemplo, 192.168.1.1 é o endereço IP do HomeStation dentro de sua <a class='help_link' href='javascript:linkContent(1,8)'>rede doméstica</a>.",
"HELP_CONTENT1_5_TITLE":"O que significa a sigla IP? O que é um endereço IP?",
"HELP_CONTENT1_6":"Ao longo dos anos, a tecnologia de acesso à <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> tem mudado para se adaptar às necessidades das pessoas e recursos. A principal razão para mudar os tipos de acesso à <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> tem sido a velocidade de conexão. Atualmente, é necessário uma velocidade muito boa se você quiser ter todos os melhores recursos da <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> (animações, televisão on-line, 3D, vídeo, etc). Conhecida como <a class='help_link' href='javascript:linkContent(2,1)'>conexão banda larga</a>, a tecnologia <a class='help_link' href='javascript:linkContent(2,3)'>ADSL</a> é a mais comum para residências e pequenas empresas e a tecnologia <a class='help_link' href='javascript:linkContent(2,4)'>3G</a> é a favorita para dispositivos móveis (como telefones celulares ou computadores portáteis).",
"HELP_CONTENT1_6_TITLE":"Como posso conectar-me à Internet?",
"HELP_CONTENT1_7":"A chave para a <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> é a capacidade de se conectar e enviar informações entre redes diferentes. Assim, a informação pode chegar a computadores que não estão em <a class='help_link' href='javascript:linkContent(1,8)'>sua rede local</a>. Para isso, é necessário que a rede tenha um equipamento (HomeStation ou um roteador convencional) encarregado de conectar-se às outras redes que estão na <a class='help_link' href='javascript:linkContent(1,8)'>Internet</a>.",
"HELP_CONTENT1_7_TITLE":"Porque preciso do HomeStation para navegar na Internet?",
"HELP_CONTENT1_8":"Dentro de sua casa, há também uma rede de computadores como a <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>, mas muito menor. Isto permite navegar pela sua rede local (conhecida como 'Home Network', ou rede doméstica) e comunicar entre os dispositivos (como computadores ou impressoras) que estão conectados através de seu HomeStation para, por exemplo, compartilhar arquivos entre eles.",
"HELP_CONTENT1_8_TITLE":"Há uma rede dentro da minha casa também?",
"HELP_CONTENT1_9":"Um navegador ou 'web browser' é um programa ou software, geralmente gratuito, que nos permite visualizar páginas web na Internet. Os navegadores mais populares são o <a class='help_link' href='http://www.microsoft.com/windows/internet-explorer/default.aspx' target='_blank'>Internet Explorer</a>, <a class='help_link' href='http://www.mozilla.com/firefox' target='_blank'>Mozilla Firefox</a>, <a class='help_link' href='http://www.apple.com/safari/' target='_blank'>Safari</a> e <a class='help_link' href='http://www.google.com/chrome' target='_blank'>Google Chrome</a>.",
"HELP_CONTENT1_9_TITLE":"O que é um navegador ou 'web browser' e para que serve?",
"HELP_CONTENT2_1":"Bandwidth (Largura de banda) é a quantidade de informações ou dados que você pode enviar e receber através de sua conexão <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>. A largura de banda é normalmente medida em <a class='help_link' href='javascript:linkContent(2,2)'>bits por segundo (bit/s ou bps)</a>, <a class='help_link' href='javascript:linkContent(2,2)'>kilobits por segundo (kbit/s ou kbps)</a> ou <a class='help_link' href=javascript:linkContent(2,2)'>megabits por segundo (Mb/s ou Mbps)</a>. Em geral, uma conexão com grande largura de banda é conhecida como 'banda larga' e é aquela que pode transmitir um video de forma contínua (sem cortes ou quebras).",
"HELP_CONTENT2_1_TITLE":"O que é uma conexão de banda larga?",
"HELP_CONTENT2_2":"Um bit é a menor unidade de informação usado na computação. Com ele, podemos representar dois valores, tais como: verdadeiro ou falso, aberto ou fechado, branco ou preto ... Basta atribuir um destes valores para zero (0) e o outro para um (1). Para representar ou codificar mais informações é preciso agrupá-los em um número maior de bits. Assim, um kilobit é um milhar de bits, um megabit é um milhão de bits e um gigabit é um bilhão de bits. As velocidades de conexões mais comuns de <a class='help_link' href='javascript:linkContent(2,1)'>banda larga</a> são, geralmente, entre 1 e 6 Mbps; Por exemplo, com uma velocidade de 1 Mbps leva cerca de um minuto para <a class='help_link' href='javascript:linkContent(1,13)'>baixar</a> uma música da <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>.",
"HELP_CONTENT2_2_TITLE":"O que é um bit? O que é um mega? E um giga?",
"HELP_CONTENT2_3":"ADSL é a sigla para  'Asymmetric Digital Subscriber Line' (Linha Digital de assinante, taxa assimétrica) e é a tecnologia usada para conectar à <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> por <a class='help_link' href='javascript:linkContent(2,1)'>banda larga</a>.<br> Em alguns países, precisa fornecer seu nome de usuário e sua senha ADSL para que a conexão ADSL do seu HomeStation funcione. Se este for o seu caso, basta clicar sobre o ícone ADSL do Mapa de Rede no menu 'Configurar conexão ADSL' e digitar seu nome de usuário e senha e clicar em 'Aceitar'.",
"HELP_CONTENT2_3_TITLE":"O que é ADSL?",
"HELP_CONTENT2_4":"3G é a sigla para a terceira geração de telefonia móvel. É uma tecnologia inicialmente utilizada em telefones celulares para enviar e receber chamadas, mas por ser uma conexão de <a class='help_link' href='javascript:linkContent(2,1)'>banda larga</a> também é usada para se conectar à <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> através de um telefone móvel ou um computador portátil.<br/>O HomeStation pode usar um modem USB 3G para servir de redundância ao acesso ADSL através de sua conexão à porta USB e configuração dos seus parâmetros clicando no ícone 3G da interface avançada. Atualmente, os seguintes modelos são suportados pelo HomeStation:<br/><br/>HUAWEI E156&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;NOKIA CS-11<br/>HUAWEI E160&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ZTE MF110<br/>HUAWEI E1756&nbsp;&nbsp;&nbsp;ZTE MF626<br/>HUAWEI E226&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ZTE MF645",
"HELP_CONTENT2_4_TITLE":"O que é 3G?",
"HELP_CONTENT3_1":"Uma senha ou 'password' é uma série secreta de caracteres (letras e números em geral), que permite ao usuário acessar um computador ou um programa. As senhas ajudam a assegurar que usuários não autorizados não tenham acesso ao que está protegido. Idealmente, a senha deve ser algo que ninguém pode adivinhar.",
"HELP_CONTENT3_1_TITLE":"O que é uma senha ou 'password'?",
"HELP_CONTENT3_10":"Em geral, é altamente recomendado ter sempre instalado e atualizado um programa <a class='help_link' href='javascript:linkContent(3,11)'>antivírus</a> e <a class='help_link' href='javascript:linkContent(3,12)'>anti-spyware</a>. Se você quer ter uma proteção adicional você pode instalar um <a class='help_link' href='javascript:linkContent(3,13)'>firewall</a> e, se você tiver crianças pequenas em casa, você pode instalar um programa de controle parental.",
"HELP_CONTENT3_10_TITLE":"Quais programas preciso para navegar com segurança na Internet?",
"HELP_CONTENT3_11":"É um software que visa prevenir e evitar a infecção do <a class='help_link' href='javascript:linkContent(3,8)'>vírus</a>,  bem como impedir sua propagação. Tem capacidade para detectar e remover <a class='help_link' href='javascript:linkContent(3,8)'>vírus</a> e restaurar os arquivos afetados pela infecção.",
"HELP_CONTENT3_11_TITLE":"O que é um antivírus? Para que serve?",
"HELP_CONTENT3_12":"Um software espião ('Spyware') é aquele que coleta informações do computador no qual ele está operando. Normalmente ele entra e opera em computadores sem que o usuário perceba. Portanto, um programa anti-espião é usado para remover programas espiões.",
"HELP_CONTENT3_12_TITLE":"O que é um software anti-espião (antispyware)? Para que serve?",
"HELP_CONTENT3_13":"Firewall é um software que impede a utilização  e o acesso não autorizados ao seu computador, bem como ataques da <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a>. Um firewall examina o que vem a partir da <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> e, dependendo da sua natureza, lhe permite continuar ou, inversamente, o bloqueia. Ou seja, o seguro entra e o potencialmente nocivo (um ataque) é rejeitado. Se instalado, todas as mensagens que entram ou saem da <a class='help_link' href='javascript:linkContent(1,8)'>rede da sua casa</a> passam pelo firewall, que examina cada mensagem e bloqueia aquelas que não atendam aos critérios de segurança. É importante lembrar que um firewall não elimina os problemas de <a class='help_link' href='javascript:linkContent(3,8)'>vírus</a> do computador, mas quando usado em conjunto com atualizações periódicas que o sistema operacional Windows oferece (ou outro sistema operacional) e um bom <a class='help_link' href='javascript:linkContent(3,11)'>anti-vírus</a>, trará mais segurança e proteção adicional para o seu computador e a sua rede.",
"HELP_CONTENT3_13_TITLE":"O que é um firewall? Para que serve?",
"HELP_CONTENT3_2":"Sim, o HomeStation tem uma senha de configuração. Ela permite que você faça alterações nas configurações do HomeStation e garante que só você possa fazer essas alterações. Você pode entrar na página web do seu HomeStation sem senha e ver o estado da sua rede, mas quando você tenta acessar funções protegidas será solicitada a senha. Uma vez fornecida a senha, você poderá configurar a sua rede.",
"HELP_CONTENT3_2_TITLE":"Existe senha no HomeStation? Para que serve?",
"HELP_CONTENT3_3":"A senha inicial encontra-se numa etiqueta na parte de baixo do HomeStation. Você pode mudar para uma diferente, e recomendamos que o faça. Para isso, clique no link 'Alterar Senha' no canto superior direito do 'Mapa de Rede'.<br> Como esta é uma operação delicada, se você não digitou sua senha, ela lhe será pedida. <br>Finalmente, aparecerá o formulário de alteração de senha. No primeiro campo terá de digitar sua senha atual e depois a nova senha duas vezes, para ter certeza de que a escreveu corretamente. <br>O Indicador de força irá dizer se a sua nova senha é boa ou se é fácil de adivinhar.",
"HELP_CONTENT3_3_TITLE":"Como faço para alterar a senha de configuração?",
"HELP_CONTENT3_4":"Você pode restaurar a senha inicial pressionando o botão 'Reset' no painel traseiro do HomeStation  por 10 segundos. <br>Sua senha será a mesma encontrada na etiqueta do HomeStation. <br>Note-se que o HomeStation irá reiniciar com as configurações de fábrica. Sua conexão de Internet terá que ser reconfigurada e você perderá todas as suas configurações pessoais.",
"HELP_CONTENT3_4_TITLE":"Esqueci a senha de configuração, o que posso fazer?",
"HELP_CONTENT3_5":"O fato de conectar-se à Internet não representa nenhum perigo. Outra coisa bem diferente são as ameaças potenciais que podem resultar de um uso insensato e pouco prudente de alguns serviços da <a class='help_link' href='javascript:linkContent(1,1)'>Internet</a> (por exemplo, executar arquivos não confiáveis). Note-se que existem <a class='help_link' href='javascript:linkContent(1,10)'>sites</a> que são totalmente confiáveis. Em geral, todos aqueles de uma marca conhecida, sites pessoais, portais, sites de busca, de compras ... A regra para uma navegação segura pode ser resumida como: se alguém lhe pedir para instalar alguma coisa que você não sabe o que é ou o <a class='help_link' href='javascript:linkContent(3,11)'>antivírus</a> informar sobre uma possível ameaça ... NÃO FAÇA, NÃO INSTALE NADA QUE NÃO CONHEÇA e saia da página imediatamente, fechando o navegador, se necessário.",
"HELP_CONTENT3_5_TITLE":"Corro algum risco ao conectar-me à Internet?",
"HELP_CONTENT3_6":"É cada vez mais importante proteger as nossas informações pessoais e confidenciais, como <a class='help_link' href='javascript:linkContent(3,1)'>senhas</a>, números de cartões de crédito e informações bancárias. A lista a seguir mostra algumas coisas que você pode fazer para proteger seus dados confidenciais na <a class='help_link' href='javascript:linkContent(3,1)'>Internet</a>:<ul><li>-'Antes de fornecer suas informações, verificar se a empresa existe. Um <a class='help_link' href='javascript:linkContent(1,10)'>site</a> não é prova de que a empresa existe. <li>- Certificar se o <a class='help_link' href='javascript:linkContent(1,10)'>site</a> é seguro, se a URL começa com 'https' em vez de apenas 'http'. <li>- Quando você usar seu cartão de crédito em um novo <a class='help_link' href='javascript:linkContent(1,10)'>site</a>, verificar seu extrato no dia seguinte para garantir que nenhuma compra não autorizada tenha sido feita .<li>- Não utilizar a mesma <a class='help_link' href='javascript:linkContent(3,1)'>senha</a> para todas as contas. Se uma conta for comprometida, todas as contas estarão comprometidas .<li>- Manter seu <a class='help_link' href='javascript:linkContent(3,11)'>antivírus</a> atualizado. <li>- Não abrir anexos de e-mails de alguém que não conheça .<li>- Nunca responder a qualquer e-mail que peça seus dados bancários. <li>- Imprimir recibos de suas transações.",
"HELP_CONTENT3_6_TITLE":"Como posso evitar fraudes e proteger os meus dados pessoais?",
"HELP_CONTENT3_7":"Sim, mas não se assuste. O mais comum é via e-mail ou <a class='help_link' href='javascript:linkContent(1,13)'>baixar</a> um arquivo de uma <a class='help_link' href='javascript:linkContent(1,10)'>página web</a> de origem duvidosa. E, em geral quando há uma troca de arquivos. Mas pode ser evitada se você seguir algumas regras simples e usar o bom senso:<ul><li>- Cada vez que nos deparamos com um e-mail que contém um arquivo devemos ter cuidado para não abri-lo sem antes passar um bom <a class='help_link' href='javascript:linkContent(3,11)'>antivírus</a>, e se for de origem duvidosa, devemos apagá-lo .<li>- Para os arquivos que baixamos de uma <a class='help_link' href='javascript:linkContent(1,10)'>página web</a> devemos seguir a seguinte regra: Se alguém lhe pedir para instalar alguma coisa que você não sabe o que é ou o <a class='help_link' href='javascript:linkContent(3,11)'>antivírus</a> informar sobre uma possível ameaça ... NÃO FAÇA, NÃO INSTALE NADA QUE NÃO CONHEÇA.</ul>",
"HELP_CONTENT3_7_TITLE":"O meu computador pode ser infectado por um vírus através da Internet?",
"HELP_CONTENT3_8":"Um vírus de computador é um software auto-executável e se espalha inserindo cópias de si mesmo para outro programa ou documento. Como os vírus humanos, os vírus de computador podem se propagar de várias maneiras: alguns causam somente efeitos irritantes suaves, enquanto outros podem danificar o hardware, software ou arquivos. Quase todos os vírus são anexados a um arquivo executável, o que significa que o vírus pode estar no seu computador, mas não infectá-lo a menos que você execute ou abra o programa infectado. É importante notar que um vírus não pode continuar a sua propagação sem a ação humana (por exemplo, executar um programa infectado). Pessoas contribuem para a propagação do vírus, muitas vezes inconscientemente, através da troca de arquivos infectados ou ao enviar e-mails com vírus como anexos.",
"HELP_CONTENT3_8_TITLE":"O que é um vírus de computador?",
"HELP_CONTENT3_9":"Muitas vezes pensamos que nossos problemas são causados por <a class='help_link' href='javascript:linkContent(3,8)'>vírus</a>. Os problemas a seguir não são geralmente causados por vírus:<ul><li>- Problemas de hardware. Não existem <a class='help_link' href='javascript:linkContent(3,8)'>vírus</a> que podem danificar o hardware. <li>- O computador produz um 'bip' quando se inicia e a tela não exibe nada. Na maioria das vezes isso ocorre devido a um problema de hardware durante o processo de boot.<li>- Você não pode abrir um arquivo. Se  não tiver problemas para abrir outros arquivos, pode ser que  não possa abrir aquele arquivo específico por estar danificado.</ul>",
"HELP_CONTENT3_9_TITLE":"O que não é um vírus de computador?",
"HELP_CONTENT4_1":"O mapa de rede é uma representação gráfica de todos os computadores e dispositivos (por exemplo, impressoras, telefones móveis, consoles de jogos, ...) na sua <a class='help_link' href='javascript:linkContent(1,8)'>rede doméstica</a>. Mostra os dispositivos que estão conectados e os que não estão (em cor cinza mais clara). Também indica se a conexão se dá via rede com <a class='help_link' href='javascript:linkContent(4,5)'>cabo</a> ou via <a class='help_link' href='javascript:linkContent(4,5)'>rede sem fio (WiFi)</a>.",
"HELP_CONTENT4_1_TITLE":"O que é o mapa de rede?",
"HELP_CONTENT4_10":"Em redes sem fio os dados e as comunicações são transmitidas pelo 'ar', sendo necessário um mecanismo para evitar intrusos que possam ouvir as suas comunicações, usar sua rede, alterar os seus dados, etc ...<br>Para isso existem mecanismos e protocolos para criptografar e proteger as comunicações sem fio. Não usá-los é totalmente inseguro. <br>Se você usá-los, deve saber que existem alguns que são antigos e não representam um obstáculo para intrusos (Protocolo WEP, baixa segurança). Eles ainda são usados para conectar dispositivos WiFi mais antigos, mas não recomendamos a sua utilização. <br>Se você quiser a sua rede segura, você deve usar um alto nível de segurança. Isto significa que as suas comunicações wireless devem ser protegidas pelos protocolos WPA ou WPA2 que são atualmente considerados seguros.",
"HELP_CONTENT4_10_TITLE":"O que significa nível de segurança da minha rede sem fio (WiFi)? ",
"HELP_CONTENT4_11":"A força de segurança de sua chave indica a dificuldade do intruso que tenta conectar à rede sem sua permissão de adivinhá-la.",
"HELP_CONTENT4_11_TITLE":"O que é força de segurança da chave da minha rede sem fio (WiFi)?",
"HELP_CONTENT4_12":"A rede Wi-Fi pode usar diferentes faixas de freqüência, normalmente numeradas de 1 a 13, chamadas de canal. Se a sua rede e as redes vizinhas estão usando o mesmo canal de freqüência, pode haver interferência entre as duas redes ocasionando uma queda na qualidade de ambas ou até mesmo não podendo ser utilizadas. <br>No modo manual, você pode forçar seu HomeStation a utilizar canais específicos e tentar evitar esses problemas.",
"HELP_CONTENT4_12_TITLE":"O que é canal da minha rede sem fio (WiFi)? Por que colocá-la no modo manual?",
"HELP_CONTENT4_13":"É um protocolo pelo qual seu HomeStation atribui automaticamente endereços IP e outras configurações de rede aos dispositivos que se conectam à sua rede doméstica. É mais fácil e evita que você tenha que configurar manualmente os parâmetros de rede para cada um dos seus computadores.",
"HELP_CONTENT4_13_TITLE":"O que é DHCP? Para que serve?",
"HELP_CONTENT4_2":"A maneira mais fácil é se conectar à rede sem fio WiFi criada pela HomeStation. Se o dispositivo estiver em um local fixo. próximo à HomeStation. você também pode conectá-lo via cabo RJ45. <br>Se você optar por utilizar a rede sem fio. acesse o menu de configuração. clicando no ícone HomeStation dentro do Mapa de Rede. Observe esses parâmetros de configuração do WiFi pois serão necessários para conectar seus dispositivos. <br>Conecte cada um dos seus dispositivos seguindo as instruções de seu sistema operacional.Em geral, deve-se entrar na configuração de rede sem fio do dispositivo, procurar a WiFi da HomeStation e se conectar a ela. Se for solicitado um protocolo de segurança, selecione um de acordo com o nível de segurança que você configurou no HomeStation. As siglas entre parênteses lhe ajudarão. <br>Quando solicitado pela chave WiFi, coloque a mesma que foi configurada na WiFi do HomeStation. <br>Assim os dispositivos poderão se conectar à sua rede doméstica. Para que tenha acesso à internet recomendamos ativar o DHCP no HomeStation e configurar os dispositivos para obter endereço IP automaticamente.",


"HELP_CONTENT4_2_TITLE":"Como posso conectar meus dispositivos (computadores, telefones celulares,...) à Internet através do HomeStation?",
"HELP_CONTENT4_3":"USB é a sigla de 'Universal Serial Bus' (Barramento Serial Universal). Nos computadores, a entrada USB é um sistema que transfere dados ou energia entre os componentes do seu computador ou entre computadores. O HomeStation, através da interface USB, pode se comunicar com impressoras (para compartilhar uma única impressora com todos os computadores de sua <a class='help_link' href='javascript:linkContent(1,8)'>rede doméstica</a>), com HDs e pen drives (para acessar seus arquivos através de qualquer computador de sua <a class='help_link' href='javascript:linkContent(1,8)'>rede doméstica</a>).",
"HELP_CONTENT4_3_TITLE":"Para que serve a entrada USB do HomeStation?",
"HELP_CONTENT4_4":"Se necessitar conectá-los ao mesmo tempo, recomenda-se utilizar um Hub expansor de portas USB. São baratos e você pode facilmente ter 4 dispositivos USB conectados à HomeStation.",
"HELP_CONTENT4_4_TITLE":"HomeStation só possui uma entrada USB, como conecto um disco e uma impressora ao mesmo tempo?",
"HELP_CONTENT4_5":"A conexão via cabo é mais segura, pois requer um acesso físico direto ao seu HomeStation. Nunca terá intrusos em sua rede se desabilitar o WiFi e somente utilizar conexões cabeadas. <br>No entanto, será muito mais fácil para você conectar seus computadores à rede sem fio, e continuará a ser seguro, se configurado corretamente. <br>A conexão por cabo é mais rápida, mas se você usa o computador para acessar a Internet, normalmente você não vai notar diferença entre os computadores ligados por cabo ou sem fio.",
"HELP_CONTENT4_5_TITLE":"Qual é a diferença entre um computador conectado via cabo ou rede sem fio (WiFi)?",
"HELP_CONTENT4_6":"Neste tipo de rede as comunicações entre dispositivos é feita através do 'ar'. Nenhum cabo é necessário para transmitir 'mensagens' de um dispositivo para outro, uma vez que essas mensagens se transformam em sinais eletromagnéticos que viajam através do ar como a luz. Não se assuste, esses sinais são seguros, de fato, a luz que vemos também é radiação eletromagnética, emitida dentro de uma determinada gama de frequências que nossos olhos são capazes de captar. <br>No caso do WiFi, os sinais eletromagnéticos são emitidos na banda de 2,4 Gigahertz. <br>Seu HomeStation atua como ponto de acesso ou gerenciador da rede sem fio, permitindo ou negando acesso aos dispositivos da rede.<br>",
"HELP_CONTENT4_6_TITLE":"Como funciona a rede sem fio (WiFi)?",
"HELP_CONTENT4_8":"Você encontrará o menu de configurações da rede sem fio clicando no ícone HomeStation dentro do Mapa da Rede. Este menu contém uma seção sobre as configurações WiFi onde pode-se configurar todos os parâmetros relacionados à rede sem fio de seu HomeStation. <br>Pode-se ativar e desativar a rede sem fio. <br>Pode-se ver e alterar o nome da rede sem fio. <br>Pode-se tornar a rede visível aos dispositivos ou oculta, para evitar a exposição de sua rede a intrusos. <br>Pode-se definir o nível de segurança e a chave para sua rede sem fio. <br>E, finalmente, pode-se configurar o modo de seleção de canais utilizado em sua rede.",
"HELP_CONTENT4_8_TITLE":"Como faço para configurar minha rede sem fio (WiFi)?",
"HELP_CONTENT4_9":"Basta entrar no menu de configuração do HomeStation e clicar no ícone HomeStation no Mapa da Rede. Na seção de rede sem fio, pode-se ver e modificar o nome de sua WiFi. <br>Dependendo da localização, é bem possível que existam muitas redes no ambiente. Colocar um nome que significa algo para você o ajudará a encontrar sua rede sem fio. <br>Se decidir alterar o nome com sua rede funcionando, tenha em mente que precisará reconfigurar a conexão sem fio de seus dispositivos.<br>",
"HELP_CONTENT4_9_TITLE":"Como posso mudar o nome de minha rede sem fio (WiFi)? Por que é útil?",
"HELP_CONTENT5_1":"Pode conectar qualquer dispositivo IP que utilize conector de rede RJ45 (o típico conector de cabo de rede, um pouco maior que o conector do cabo telefônico), ou que suporte WiFi (nesse caso verifique no manual do dispositivo se o mesmo suporta um dos seguintes padrões 802.11b, 802.11g ou 802.11n).",
"HELP_CONTENT5_1_TITLE":"Que tipo de equipamento pode se conectar à Internet através do HomeStation?",
"HELP_CONTENT5_2":"Se está conectado via WiFi, por serem antigos é possível que não estejam preparados para se comunicar utilizando o protocolo de segurança selecionado. Verifique o nível de segurança e o manual do fabricante do dispositivo. Se não suportar WPA, terá que selecionar um nível de segurança menor (protocolo WEP), ou 'Sem segurança' no HomeStation, para poder conectar seu dispositivo. No entanto, o nível de segurança de todos os dispositivos em sua rede ficará em um que não recomendamos.",
"HELP_CONTENT5_2_TITLE":"Meus equipamentos antigos não se conectam. O que pode estar acontecendo?",
"HELP_CONTENT5_3":"Você teve recentemente uma visita em casa? É possível que se trate de algum computador portátil ou celular que esteve em sua casa. <br>Se não, primeiro verifique o símbolo que acompanha o ícone do dispositivo, no canto superior direito. Informa se o dispositivo está conectado via rede cabeada, Wi-Fi ou USB. Isso deve ajudar a identificar o dispositivo. <br>Verifique se está conectado ou desconectado, isso também pode dar uma pista. Pode-se tentar ligar e desligar dispositivos até que o status do equipamento a ser identificado seja alterado no Mapa da Rede. <br>Uma vez localizado o equipamento, recomendamos personalizá-lo, dando-lhe um nome e atribuindo um tipo de dispositivo, para que no futuro fique claro de que equipamento se trata. <br>Se é um equipamento que não irá se conectar novamente, entre em sua configuração e clique em ‘Remover dispositivo’. Assim não voltará a incomodá-lo.",
"HELP_CONTENT5_3_TITLE":"Apareceu um equipamento que não identifico porque seu nome é uma série de números (192.168...). Como posso identificá-lo?",
"HELP_CONTENT5_4":"No Mapa de Rede, clique no dispositivo para abrir sua configuração. Clique em 'Remover dispositivo' e o mesmo não aparecerá mais em seu mapa de rede. A não ser, é claro, que volte a conectá-lo. <br>Se não encontrar o link 'Remover dispositivo', pode ser que o dispositivo encontra-se conectado. Nesse caso desconecte e tente novamente.",
"HELP_CONTENT5_4_TITLE":"Como deixo de ver em meu mapa de rede um equipamento que não uso?",
"HELP_CONTENT5_5":"No Mapa da Rede pode-se ver o ícone do HomeStation e, à sua direita, uma seção em que aparecem os dispositivos de sua rede. São equipamentos que estão ou estiveram ligados à sua rede doméstica, ou por cabo, por WiFi ou via USB. Alguns podem já não estar ligados e apareçam em cinza mais claro. <br>Conectados ou não, pode-se configurá-los clicando em seu ícone. Isso irá abrir uma janela de diálogo onde poderá realizar as seguintes opções: <br>-Dar um nome ao equipamento. <br>-Atribuir um tipo de dispositivo, para que apareça representado com uma imagem mais adequada. <br>-Ver seu endereço IP e seu status. <br>- Remover o dispositivo. <br>-Abrir portas para o dispositivo. <br>Se necessitar uma configuração mais avançada de aplicações e portas, clique em 'Configurar aplicações e portas'.",
"HELP_CONTENT5_5_TITLE":"Como faço para configurar um equipamento?",
"HELP_CONTENT5_6":"É uma equipamento que ainda não foi definido, ou seja, um dispositivo para o qual você ainda não atribuíu o nome e nem o tipo de dispositivo. Por isso que aparecerá como um ícone genérico que não dá qualquer informação sobre o tipo de dispositivo e pode aparecer com um endereço IP em vez do nome. <br>Normalmente será um dispositivo novo na rede que se conectou recentemente. Adicionalmente, se você não ativou uma alta segurança em seu WiFi, pode se tratar do equipamento de um vizinho que está invadindo a sua rede. Nesse caso, remover o dispositivo não impedirá que ele volte a conectar, será necessário aumentar o nível de segurança de seu WiFi.",
"HELP_CONTENT5_6_TITLE":"O que é um equipamento desconhecido?",
"HELP_CONTENT5_7":"É verdade! Se você ligar ao seu HomeStation um dispositivo de armazenamento USB com seus arquivos, você pode acessá-los de qualquer um dos computadores de sua casa. Conecte em seu HomeStation e aparecerá no mapa da rede. <br>Se você ligar a impressora USB no seu HomeStation, você pode imprimir a partir de qualquer um dos computadores de sua casa. Conecte em seu HomeStation e também aparecerá no mapa de rede.",
"HELP_CONTENT5_7_TITLE":"Sabia que você pode compartilhar seus arquivos e impressora para os computadores na rede de sua casa?",
"HELP_CONTENT5_8":"Para acessar os arquivos de um computador com sistema operacional Windows, vá até a página inicial do seu HomeStation, localize o ícone do dispositivo (pen drive ou HD) no mapa da rede, clique sobre ele e baixe o arquivo de instalação no seu computador. Execute-o de lá e siga as instruções.",
"HELP_CONTENT5_8_TITLE":"Como faço para conseguir acessar do meu computador o conteúdo do meu pen drive ou do meu HD ligado a USB do HomeStation?",
"HELP_CONTENT5_9":"Para acessar a impressora a partir de um computador com sistema operacional Windows, vá até a página inicial do seu HomeStation, localize o ícone da impressora no mapa da rede, clique sobre ele e baixe o arquivo de instalação no seu computador. Execute-o de lá e siga as instruções. Se você tiver qualquer problema no processo, é recomendável que você instale o driver da impressora seguindo as instruções do fabricante e tente novamente.",
"HELP_CONTENT5_9_TITLE":"Como faço para instalar no meu computador a impressora USB conectada ao HomeStation?",
"HELP_CONTENT6_1":"As portas são usadas para que as aplicações de um computador comuniquem-se entre si ou com outras aplicações em outros computadores. <br>Em um computador existem várias aplicações em execução ao mesmo tempo e se comunicando com outras aplicações em outros computadores através da Internet. Essas comunicações são feitas através do envio de mensagens. Imagine que eu estou conversando com você, meu aplicativo de mensagens envia uma mensagem para o seu computador com o texto que estou escrevendo. Esta mensagem tem o endereço IP do seu computador como o endereço de destino e a rede sabe fazer chegar a mensagem ao seu computador. Mas uma vez que seu computador tenha recebido a mensagem como saber o que fazer com ela? Chegou uma mensagem da rede, mas para qual destino? Para  o navegador web? Para um jogo On-Line que também está em execução? <br>Para resolver isso, as portas são utilizadas. Elas são como endereços ou caixas postais dentro de um computador. Uma aplicação está sendo executada em uma porta específica (ou mais), e existem outras aplicações que são capazes de enviar mensagens para esse computador para essa porta específica. O sistema operacional recebe a mensagem da rede e passa para a aplicação que está sendo executada nessa porta. <br>Assim, as portas são um conceito lógico, um número, não são uma coisa física, e cada equipamento tem um grande número delas, 1-65535, para que as aplicações as utilizem em suas comunicações. <br>No princípio estão todas livres e as aplicações as reservam quando necessário.", 

"HELP_CONTENT6_1_TITLE":"O que são portas?",
"HELP_CONTENT6_2":"Consiste em configurar o seu HomeStation para permitir que sistemas externos à sua rede, encontrados na Internet, possam iniciar uma comunicação com um computador em sua rede doméstica. Isso, a princípio, não é permitido por razões de segurança, e você que tem que abrir as portas para permitir a comunicação com uma aplicação que confie. <br>Se você não entendeu bem o que são as portas, vamos um pouco mais adiante... Seus computadores têm portas para se comunicar, seu HomeStation também tem suas próprias portas para receber mensagens da Internet. Quando chegam mensagens que não tenham sido pedidas por um computador em sua rede, o HomeStation não faz nada com elas, ignorando-as. Assim, a princípio, sua rede é segura e nada de fora pode se conectar com os computadores em sua rede, se você não iniciar a comunicação. No entanto, alguns aplicações que usam muito a rede funcionariam melhor se a comunicação pudesse ser iniciada nos dois sentidos (programas de mensagens, P2P, jogos, etc ...). Essas aplicações precisam da configuração de abrir portas para funcionar. <br>O que significa abrir portas? Consiste em permitir que o seu HomeStation receba mensagens direcionadas a uma determinada porta, e faça um redirecionamente dessas mensagens para a porta de um dos computadores de sua rede. Por exemplo, se o seu console de jogos usa a porta 3655, você pode redirecionar a porta 3655 do seu HomeStation para a porta 3655 dele.",

"HELP_CONTENT6_2_TITLE":"Em que consiste abrir portas?",
"HELP_CONTENT6_3":"Algumas aplicações usadas na rede precisam da abertura de portas para funcionar ou para ir mais rápido. Geralmente programas de mensagens, plicativos P2P, jogos, etc ... <br>As portas que utilizam a aplicação serão redirecionadas do seu HomeStation para o computador ou dispositivo que a necessita. Assim, outros computadores na Internet poderão se conectar à sua aplicação.",
"HELP_CONTENT6_3_TITLE":"Por que preciso abrir uma porta?",
"HELP_CONTENT6_4":"Você tem várias maneiras:<br>A maneira mais fácil é ir para a configuração do dispositivo no mapa de rede e, na seção 'Abrir portas para este dispositivo', ativar a aplicação que deseja abrir as portas para esse dispositivo. Em seguida, clique aceitar e o HomeStation abrirá as portas apropriadas para o seu computador. <br>Se não aparecer a aplicação que deseja ou ela já estiver atribuída a outro dispositivo (o ícone do dispositivo aparecerá desativado), você deve criar uma nova aplicação em 'Configurar aplicações e portas'. Clique e crie uma nova aplicação que abra as portas necessárias para o seu dispositivo.",
"HELP_CONTENT6_4_TITLE":"Como faço para abrir uma porta para um aplicativo e atribuí-la a um dispositivo?",
"HELP_CONTENT6_5":"O uso desta seção é mais fácil do que parece. <br>À esquerda está a lista de aplicações que já estão definidas. Lembre-se que esta aplicação é um conjunto de regras que abrem portas. Não nos referimos a aplicação em si, mas o conjunto de regras (portas abertas), necessárias para que a aplicação funcione corretamente. <br>Voltando à lista, você verá à sua direita, que algumas possuem um ícone do dispositivo e outras não. O ícone indica que esta aplicação está associada a um dispositivo. HomeStation tem as portas abertas para a aplicação desse dispositivo. Não pode se associar a outro dispositivo sem cancelar a associação atual. As outras aplicações (aqueles que não possuem ícones) são aplicações que não estão associadas a nenhum dispositivo. Você pode usá-las e abrir as portas correspondentes para o dispositivo que você deseja. <br>Para modificar uma aplicação a partir da lista, clique nela e a configuração do aplicativo aparecerá no painel da direita, a partir do qual você pode mudar seu nome, suas regras para abertura de portas e atribuí-la a um dispositivo. <br>Se você precisa criar uma nova aplicação (porque ela não existe ou não está disponível), clique no botão '+' abaixo da lista de pedidos. Na configuração do painel direito aparece (vazio) para o seu novo aplicativo. Dê-lhe um nome, adicione as regras para abertura de portas que você precisa e associe a um dispositivo. <br>Se você quiser excluir uma aplicação, selecione-a na lista e clique no botão '-' abaixo da lista. <br>Para alterar o nome de uma aplicação no painel de edição de aplicativos, clique no ícone do lápis ao lado de seu nome atual e dê um nome diferente. <br>Para adicionar uma regra para um aplicativo selecionado clique em '+ Adicionar regra', e uma nova regra vazia é adicionada à lista de regras. Modificá-la. <br>Para modificar uma regra, preencha os campos do formulário que são bastante intuitivos. No primeiro botão você pode definir a possibilidade de abrir uma única porta ou um intervalo de várias portas consecutivas. Dependendo do caso, indique o número da porta ou da primeira e última porta do intervalo. Finalmente, você deve indicar se as portas devem ser abertas somente para o tráfego TCP, UDP ou para ambos. <br>Para apagar uma regra, clique no botão '-' no final da regra correspondente. <br>Para associar a aplicação a um dispositivo, selecione o disposivo na lista drop-down que pretende abrir as portas. <br>Quando você tiver terminado de modificar a configuração, clique em 'Salvar alterações' antes de fechar a caixa de diálogo ou de mudar de aplicação. As alterações feitas serão salvas e as portas correspondentes serão abertas.",

"HELP_CONTENT6_5_TITLE":"Como funciona a seção de configuração de aplicações e portas? ",
"HELP_CONTENT6_6":"Sim e não. <br>A princípio, o mecanismo de redirecionamento (abertura) de portas não permite que você faça isso. A porta só pode ser aberta ou redirecionada para um único dispositivo. E assim, cada aplicação só pode ser atribuída a um equipamento. <br>No entanto, uma ou mais aplicações similares podem utilizar outros números de porta. Neste caso, em cada computador, deve-se configurar a aplicação de acordo com as portas que foram atribuídas na HomeStation. Veja como fazer isso no manual da aplicação em questão.", 

"HELP_CONTENT6_6_TITLE":"Eu posso ter varios computadores configurados com as portas de uma aplicação aberta?",
"HELP_TOPIC0":"Configuração do provedor",
"HELP_TOPIC1":"Internet fácil",
"HELP_TOPIC2":"Banda Larga",
"HELP_TOPIC3":"Segurança na Internet",
"HELP_TOPIC4":"Minha rede doméstica",
"HELP_TOPIC5":"Computadores na minha rede",
"HELP_TOPIC6":"Aplicações e portas"
}
